package com.kartikworld.bangali;

public class QuestionAnswer {

    public static String question[] ={
            "১। আত্মরক্ষার জন্য অশ্বথ্থামা যে অস্ত্র নিক্ষেপ করেছিলেন তার নাম ?",
            "২। ভক্ত/ভক্তিকে রক্ষা করেন কে?",
            "৩। এক সময় শিবের আক্রমণে সূর্যদেব বারাণসীর যে স্থানে পতিত হন, সেই স্থানটি কি নামে খ্যাত?",
            "৪। আক্রমণকারী যদি ব্রাহ্মণ হয় অথবা ব্রহ্মবন্ধু হয়, তাহলে তাকে দন্ডদান করা",
            "৫। অশ্বথামা ছিলেন?",




           "৬।  ভগবদ্গীতায় কয়টি অধ্যায় আছে",
            "৭। শ্রীমদ্ভাগবতে কয়টি খন্ড বা ক্যান্টো আছে",
            "৮। ভগবদ্গীতা কৃষ্ণ অর্জুনের কাছে বলেছিলেন",
            "৯। কে কৃষ্ণকে জগন্নাথ রূপে আবির্ভূত হওয়ার অনুরোধ করেছিলেন?",
            "১০। একজন বুদ্ধিমান ব্যক্তি কার সাথে তার সময় কাটায়?",
            "১১। অর্জুন ও তার ভাইদের বলা হয়.........",
            "১২। ভগবদ্গীতা _______ ধৃতরাষ্ট্রকে বলেছেন",
            "১৩। দ্রোণাচার্যের পুত্র কে?",
            "১৪। অর্জুনের ধনুক বলা হয়",
            "১৫। ভগবদ্গীতায় কয়টি শ্লোক আছে?",
            "১৬। ভগবদ্গীতার প্রথম শ্লোকটি কে বলেছিলেন?",
            "১৭। ভগবৎ গীতা ভগবান শ্রীকৃষ্ণের কথা প্রায় কত বছর আগে বলা হয়েছিল",
            "১৮। ভগবদ্গীতা কে লিখিত আকারে প্রতিলিপি করেছেন?",
            "১৯। ভগবদ্গীতা ভগবান শ্রীকৃষ্ণ অর্জুনের কাছে কোথায় বলেছিলেন",
            "২০। গীতা সম্ভবত কখন লেখা হয়েছিল?",




    };

    public static String choices[][] = {
            {"আণবিক অস্ত্র","ব্রহ্মনিধন অস্ত্র","ব্রহ্মশির অস্ত্র","ব্রহ্ম-বান্ধব অস্ত্র"},
            {"ভক্তের ভক্ত","শিব","শাস্ত্র","ভগবান শ্রীকৃষ্ণ"},
            {"বিদ্যুন্মালি","কিরীটমালি","লোলার্ক","উন্মার্গ"},
            {"বিধেয়","বিধেয় নয়","পাপকর্ম","পুণ্যকর্ম"},
            {"ব্রাহ্মণ","ঋষি পুত্র","ক্ষত্রিয়","ব্রহ্মবন্ধু",},

            {"১৫","১৬","১৭","১৮",},
            {"১৮","২০","১০","১২",},
            {"যুদ্ধক্ষেত্রে","কুরুক্ষেত্রে","উপরের সবগুলো","উপরের কোনটিই না",},
            {"বিদ্যাপতি","নারদ","রাজা ইন্দ্রদ্যুম্ন","বিশ্বভাসু",},
            {"চোরের সাথে রাত","জুয়াড়িদের সাথে সকাল","মহিলার সঙ্গে বিকালে","উপরের সবগুলো",},
            {"পান্ডবগণ","কৌরবগণ","বৈষ্ণবগণ","ক্ষত্রিয়গণ",},
            {"অর্জুন","কৃষ্ণ","সঞ্জয়","দুর্যোধন",},
            {"অশ্বত্থামা","দ্রৌপদ","অভিমন্যু","একলব্য",},
            {"গান্ধারী","গান্ডিব","গঙ্গা","গৌরী",},
            {"৭০০","৯০০","১৮০০","১৮০০০",},
            {"ভগবান কৃষ্ণ","অর্জুন","ধৃতরাষ্ট্র","সঞ্জয়",},
            {"৩০০০","৪০০০","৫০০০","৬০০০",},
            {"বেদ ব্যাস মুনি","গণেশ","কার্তিকেয়","ব্রম্মা",},
            {"পুরী ক্ষেত্র","কুরুক্ষেত্র","রাঙা ক্ষেত্র","কোনোটিই নয়",},
            {"খ্রিস্টপূর্ব 100 সালের দিকে","300 খ্রিস্টপূর্বাব্দের কাছাকাছি","800 খ্রিস্টপূর্বাব্দের কাছাকাছি","খ্রিস্টপূর্ব 1800 সালের দিকে?",},

    };

    public static String correctAnswers[] = {
            "ব্রহ্মশির অস্ত্র",
            "ভগবান শ্রীকৃষ্ণ",
            "লোলার্ক",
            "বিধেয়",
            "ব্রহ্মবন্ধু",


            "১৮",
            "১২",
            "উপরের সবগুলো",
            "নারদ",
            "উপরের সবগুলো",
            "পান্ডবগণ",
            "সঞ্জয়",
            "অশ্বত্থামা",
            "গান্ডিব",
            "৭০০",
            "ধৃতরাষ্ট্র",
            "৫০০০",
            "গণেশ",
            "কুরুক্ষেত্র",
            "800 খ্রিস্টপূর্বাব্দের কাছাকাছি",


    };

}
